{
  "irVersion": 1,
  "exprVersion": 2,
  "components": [
    {
      "body": [
        {
          "component": "Select",
          "id": "n0",
          "outType": {
            "arr": {
              "obj": {
                "id": "int",
                "email": "string",
                "name": "string"
              }
            }
          },
          "ports": {
            "sql": "SELECT id, email, name FROM benchmark_users ORDER BY id ASC LIMIT ?",
            "p0": 100
          }
        }
      ],
      "inputPorts": {},
      "name": "FindAll",
      "output": {
        "ref": [
          "n0"
        ]
      },
      "plan": {
        "concurrency": 16,
        "groups": [
          [
            0
          ]
        ]
      },
      "outputType": {
        "arr": {
          "obj": {
            "id": "int",
            "email": "string",
            "name": "string"
          }
        }
      }
    }
  ]
}
