{
  "irVersion": 1,
  "exprVersion": 2,
  "components": [
    {
      "body": [
        {
          "component": "Select",
          "id": "n0",
          "outType": {
            "arr": {
              "obj": {
                "tenant_id": "int",
                "user_id": "int",
                "name": "string"
              }
            }
          },
          "ports": {
            "sql": "SELECT tenant_id, user_id, name FROM benchmark_tenant_users WHERE tenant_id = $1 ORDER BY user_id ASC",
            "p0": {
              "ref": [
                "tenant_id"
              ]
            }
          }
        },
        {
          "id": "rel_posts",
          "map": {
            "as": "$rel",
            "component": "Select",
            "over": {
              "ref": [
                "n0"
              ]
            },
            "batched": true,
            "relationKind": "connection",
            "ports": {
              "sql": "SELECT tenant_id, post_id, user_id, title FROM benchmark_tenant_posts JOIN unnest(?::@@PG_ARRAY_CAST@@, ?::@@PG_ARRAY_CAST@@) AS _unnest_benchmark_tenant_posts(_unnest_benchmark_tenant_posts_tenant_id, _unnest_benchmark_tenant_posts_user_id) ON benchmark_tenant_posts.tenant_id = _unnest_benchmark_tenant_posts._unnest_benchmark_tenant_posts_tenant_id AND benchmark_tenant_posts.user_id = _unnest_benchmark_tenant_posts._unnest_benchmark_tenant_posts_user_id ORDER BY post_id ASC",
              "k0": {
                "ref": [
                  "$rel",
                  "tenant_id"
                ]
              },
              "k1": {
                "ref": [
                  "$rel",
                  "user_id"
                ]
              }
            }
          },
          "outType": {
            "arr": {
              "obj": {
                "tenant_id": "int",
                "post_id": "int",
                "user_id": "int",
                "title": "string"
              }
            }
          }
        }
      ],
      "inputPorts": {
        "tenant_id": {
          "required": true,
          "type": "int"
        }
      },
      "name": "ByTenant",
      "output": {
        "obj": {
          "rows": {
            "ref": [
              "n0"
            ]
          },
          "posts": {
            "ref": [
              "rel_posts"
            ]
          }
        }
      },
      "plan": {
        "concurrency": 16,
        "groups": [
          [
            0
          ],
          [
            1
          ]
        ]
      },
      "outputType": {
        "obj": {
          "rows": {
            "arr": {
              "obj": {
                "tenant_id": "int",
                "user_id": "int",
                "name": "string"
              }
            }
          },
          "posts": {
            "arr": {
              "arr": {
                "obj": {
                  "tenant_id": "int",
                  "post_id": "int",
                  "user_id": "int",
                  "title": "string"
                }
              }
            }
          }
        }
      }
    }
  ]
}
