{
  "irVersion": 1,
  "exprVersion": 2,
  "components": [
    {
      "name": "NestedUpdate",
      "inputPorts": {
        "name": {
          "required": true,
          "type": "string"
        },
        "user_id": {
          "required": true,
          "type": "int"
        },
        "title": {
          "required": true,
          "type": "string"
        }
      },
      "body": [
        {
          "id": "tx_body_0",
          "component": "Update",
          "ports": {
            "sql": "UPDATE benchmark_users SET name = $1 WHERE id = $2",
            "p0": {
              "ref": [
                "name"
              ]
            },
            "p1": {
              "ref": [
                "user_id"
              ]
            }
          },
          "outType": {
            "obj": {
              "changes": "int",
              "lastInsertRowid": "int"
            }
          }
        },
        {
          "id": "tx_body_1",
          "component": "Update",
          "ports": {
            "sql": "UPDATE benchmark_posts SET title = $1 WHERE author_id = $2",
            "p0": {
              "ref": [
                "title"
              ]
            },
            "p1": {
              "ref": [
                "user_id"
              ]
            }
          },
          "outType": {
            "obj": {
              "changes": "int",
              "lastInsertRowid": "int"
            }
          }
        }
      ],
      "output": {
        "obj": {
          "user": {
            "ref": [
              "tx_body_0"
            ]
          },
          "post": {
            "ref": [
              "tx_body_1"
            ]
          }
        }
      },
      "outputType": {
        "obj": {
          "user": {
            "obj": {
              "changes": "int",
              "lastInsertRowid": "int"
            }
          },
          "post": {
            "obj": {
              "changes": "int",
              "lastInsertRowid": "int"
            }
          }
        }
      },
      "plan": {
        "concurrency": 1,
        "groups": [
          [
            0
          ],
          [
            1
          ]
        ]
      }
    }
  ]
}
