{
  "irVersion": 1,
  "exprVersion": 2,
  "components": [
    {
      "body": [
        {
          "component": "Select",
          "id": "n0",
          "outType": {
            "arr": {
              "obj": {
                "id": "int",
                "email": "string",
                "name": "string"
              }
            }
          },
          "ports": {
            "sql": "SELECT id, email, name FROM benchmark_users WHERE name LIKE $1 LIMIT $2",
            "p0": {
              "ref": [
                "name"
              ]
            },
            "p1": 1
          }
        },
        {
          "id": "rel_posts",
          "map": {
            "as": "$rel",
            "component": "Select",
            "over": {
              "ref": [
                "n0"
              ]
            },
            "batched": true,
            "relationKind": "connection",
            "ports": {
              "sql": "SELECT id, title, author_id FROM benchmark_posts WHERE benchmark_posts.author_id = ANY(?::@@PG_ARRAY_CAST@@) ORDER BY id ASC",
              "k0": {
                "ref": [
                  "$rel",
                  "id"
                ]
              }
            }
          },
          "outType": {
            "arr": {
              "arr": {
                "obj": {
                  "id": "int",
                  "title": "string",
                  "author_id": "int"
                }
              }
            }
          }
        }
      ],
      "inputPorts": {
        "name": {
          "required": true,
          "type": "string"
        }
      },
      "name": "FindFirst",
      "output": {
        "obj": {
          "rows": {
            "ref": [
              "n0"
            ]
          },
          "posts": {
            "ref": [
              "rel_posts"
            ]
          }
        }
      },
      "plan": {
        "concurrency": 16,
        "groups": [
          [
            0
          ],
          [
            1
          ]
        ]
      },
      "outputType": {
        "obj": {
          "rows": {
            "arr": {
              "obj": {
                "id": "int",
                "email": "string",
                "name": "string"
              }
            }
          },
          "posts": {
            "arr": {
              "arr": {
                "obj": {
                  "id": "int",
                  "title": "string",
                  "author_id": "int"
                }
              }
            }
          }
        }
      }
    }
  ]
}
