{
  "irVersion": 1,
  "exprVersion": 2,
  "components": [
    {
      "body": [
        {
          "component": "Update",
          "id": "n0",
          "outType": {
            "arr": {
              "obj": {
                "changes": "int",
                "lastInsertRowid": "int"
              }
            }
          },
          "ports": {
            "sql": "UPDATE benchmark_users AS t SET name = v.name FROM UNNEST($1::int[], $2::text[]) AS v(id, name) WHERE t.id = v.id",
            "v0": {
              "ref": [
                "ids"
              ]
            },
            "v1": {
              "ref": [
                "names"
              ]
            }
          }
        }
      ],
      "inputPorts": {
        "ids": {
          "required": true,
          "type": "array",
          "elemType": "int"
        },
        "names": {
          "required": true,
          "type": "array",
          "elemType": "string"
        }
      },
      "name": "UpdateMany",
      "output": {
        "ref": [
          "n0"
        ]
      },
      "plan": {
        "concurrency": 16,
        "groups": [
          [
            0
          ]
        ]
      },
      "outputType": {
        "arr": {
          "obj": {
            "changes": "int",
            "lastInsertRowid": "int"
          }
        }
      }
    }
  ]
}
