{"irVersion":1,"exprVersion":2,"components":[{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{"id":{"opt":"float"},"email":{"opt":"string"},"name":{"opt":"string"}}}},"ports":{"bigint":false,"params":{"arr":[]},"returning":false,"sql":"SELECT id, email, name FROM benchmark_users ORDER BY id ASC LIMIT 100","write":false}}],"inputPorts":{},"name":"findAll","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{"id":{"opt":"float"},"email":{"opt":"string"},"name":{"opt":"string"}}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{"id":{"opt":"float"},"title":{"opt":"string"},"content":{"opt":"string"},"published":{"opt":"float"},"author_id":{"opt":"float"},"created_at":{"opt":"string"}}}},"ports":{"bigint":false,"params":{"arr":[{"ref":["published"]}]},"returning":false,"sql":"SELECT id, title, content, published, author_id, created_at FROM benchmark_posts WHERE published = ? ORDER BY created_at DESC LIMIT 20 OFFSET 10","write":false}}],"inputPorts":{"published":{"required":true,"type":"value"}},"name":"filterPaginateSort","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{"id":{"opt":"float"},"title":{"opt":"string"},"content":{"opt":"string"},"published":{"opt":"float"},"author_id":{"opt":"float"},"created_at":{"opt":"string"}}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{"id":{"opt":"float"},"email":{"opt":"string"},"name":{"opt":"string"}}}},"ports":{"bigint":false,"params":{"arr":[{"ref":["name"]}]},"returning":false,"sql":"SELECT id, email, name FROM benchmark_users WHERE name LIKE ? LIMIT 1","write":false}}],"inputPorts":{"name":{"required":true,"type":"value"}},"name":"findFirst","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{"id":{"opt":"float"},"email":{"opt":"string"},"name":{"opt":"string"}}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{"id":{"opt":"float"},"email":{"opt":"string"},"name":{"opt":"string"}}}},"ports":{"bigint":false,"params":{"arr":[{"ref":["email"]}]},"returning":false,"sql":"SELECT id, email, name FROM benchmark_users WHERE email = ? LIMIT 1","write":false}}],"inputPorts":{"email":{"required":true,"type":"value"}},"name":"findUnique","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{"id":{"opt":"float"},"email":{"opt":"string"},"name":{"opt":"string"}}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":"value"},"ports":{"bigint":false,"params":{"arr":[]},"returning":false,"sql":"SELECT id, email, name FROM benchmark_users LIMIT 100","write":false},"wirePassthrough":true},{"component":"pluck","id":"n1","outType":"value","parent":"n0","ports":{"col":{"arr":["id"]},"rows":{"ref":["n0"]}},"wirePassthrough":true},{"component":"executeSQL","id":"n2","outType":{"arr":"value"},"parent":"n1","ports":{"bigint":false,"params":{"arr":[{"ref":["n1"]}]},"returning":false,"sql":"SELECT id, title, author_id FROM benchmark_posts WHERE author_id IN (SELECT value FROM json_each(?)) ORDER BY id ASC","write":false},"wirePassthrough":true},{"component":"group","id":"n3","outType":{"arr":{"obj":{}}},"parent":"n0","ports":{"children":{"ref":["n2"]},"fk":{"arr":["author_id"]},"into":"posts","parents":{"ref":["n0"]},"pk":{"arr":["id"]},"single":false}}],"inputPorts":{},"name":"nestedFindAll","output":{"ref":["n3"]},"plan":{"concurrency":16,"groups":[[0],[1],[2],[3]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":"value"},"ports":{"bigint":false,"params":{"arr":[{"ref":["name"]}]},"returning":false,"sql":"SELECT id, email, name FROM benchmark_users WHERE name LIKE ? LIMIT 1","write":false},"wirePassthrough":true},{"component":"pluck","id":"n1","outType":"value","parent":"n0","ports":{"col":{"arr":["id"]},"rows":{"ref":["n0"]}},"wirePassthrough":true},{"component":"executeSQL","id":"n2","outType":{"arr":"value"},"parent":"n1","ports":{"bigint":false,"params":{"arr":[{"ref":["n1"]}]},"returning":false,"sql":"SELECT id, title, author_id FROM benchmark_posts WHERE author_id IN (SELECT value FROM json_each(?)) ORDER BY id ASC","write":false},"wirePassthrough":true},{"component":"group","id":"n3","outType":{"arr":{"obj":{}}},"parent":"n0","ports":{"children":{"ref":["n2"]},"fk":{"arr":["author_id"]},"into":"posts","parents":{"ref":["n0"]},"pk":{"arr":["id"]},"single":false}}],"inputPorts":{"name":{"required":true,"type":"value"}},"name":"nestedFindFirst","output":{"ref":["n3"]},"plan":{"concurrency":16,"groups":[[0],[1],[2],[3]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":"value"},"ports":{"bigint":false,"params":{"arr":[{"ref":["email"]}]},"returning":false,"sql":"SELECT id, email, name FROM benchmark_users WHERE email = ? LIMIT 1","write":false},"wirePassthrough":true},{"component":"pluck","id":"n1","outType":"value","parent":"n0","ports":{"col":{"arr":["id"]},"rows":{"ref":["n0"]}},"wirePassthrough":true},{"component":"executeSQL","id":"n2","outType":{"arr":"value"},"parent":"n1","ports":{"bigint":false,"params":{"arr":[{"ref":["n1"]}]},"returning":false,"sql":"SELECT id, title, author_id FROM benchmark_posts WHERE author_id IN (SELECT value FROM json_each(?)) ORDER BY id ASC","write":false},"wirePassthrough":true},{"component":"group","id":"n3","outType":{"arr":{"obj":{}}},"parent":"n0","ports":{"children":{"ref":["n2"]},"fk":{"arr":["author_id"]},"into":"posts","parents":{"ref":["n0"]},"pk":{"arr":["id"]},"single":false}}],"inputPorts":{"email":{"required":true,"type":"value"}},"name":"nestedFindUnique","output":{"ref":["n3"]},"plan":{"concurrency":16,"groups":[[0],[1],[2],[3]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":"value"},"ports":{"bigint":false,"params":{"arr":[]},"returning":false,"sql":"SELECT id, email, name FROM benchmark_users LIMIT 100","write":false},"wirePassthrough":true},{"component":"pluck","id":"n1","outType":"value","parent":"n0","ports":{"col":{"arr":["id"]},"rows":{"ref":["n0"]}},"wirePassthrough":true},{"component":"executeSQL","id":"n2","outType":{"arr":"value"},"parent":"n1","ports":{"bigint":false,"params":{"arr":[{"ref":["n1"]}]},"returning":false,"sql":"SELECT id, title, author_id FROM benchmark_posts WHERE author_id IN (SELECT value FROM json_each(?)) ORDER BY id ASC","write":false},"wirePassthrough":true},{"component":"pluck","id":"n3","outType":"value","parent":"n2","ports":{"col":{"arr":["id"]},"rows":{"ref":["n2"]}},"wirePassthrough":true},{"component":"executeSQL","id":"n4","outType":{"arr":"value"},"parent":"n3","ports":{"bigint":false,"params":{"arr":[{"ref":["n3"]}]},"returning":false,"sql":"SELECT id, body, post_id FROM benchmark_comments WHERE post_id IN (SELECT value FROM json_each(?)) ORDER BY id ASC","write":false},"wirePassthrough":true},{"component":"group","id":"n5","outType":{"arr":"value"},"parent":"n2","ports":{"children":{"ref":["n4"]},"fk":{"arr":["post_id"]},"into":"comments","parents":{"ref":["n2"]},"pk":{"arr":["id"]},"single":false},"wirePassthrough":true},{"component":"group","id":"n6","outType":{"arr":{"obj":{}}},"parent":"n0","ports":{"children":{"ref":["n5"]},"fk":{"arr":["author_id"]},"into":"posts","parents":{"ref":["n0"]},"pk":{"arr":["id"]},"single":false}}],"inputPorts":{},"name":"nestedRelations","output":{"ref":["n6"]},"plan":{"concurrency":16,"groups":[[0],[1],[2],[3],[4],[5],[6]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":"value"},"ports":{"bigint":false,"params":{"arr":[]},"returning":false,"sql":"SELECT tenant_id, user_id, name FROM benchmark_tenant_users ORDER BY user_id ASC LIMIT 100","write":false},"wirePassthrough":true},{"component":"pluck","id":"n1","outType":"value","parent":"n0","ports":{"col":{"arr":["tenant_id","user_id"]},"rows":{"ref":["n0"]}},"wirePassthrough":true},{"component":"executeSQL","id":"n2","outType":{"arr":"value"},"parent":"n1","ports":{"bigint":false,"params":{"arr":[{"ref":["n1"]}]},"returning":false,"sql":"SELECT tenant_id, post_id, user_id, title FROM benchmark_tenant_posts WHERE EXISTS (SELECT 1 FROM json_each(?) je WHERE json_extract(je.value, '$[0]') = benchmark_tenant_posts.tenant_id AND json_extract(je.value, '$[1]') = benchmark_tenant_posts.user_id) ORDER BY post_id ASC","write":false},"wirePassthrough":true},{"component":"pluck","id":"n3","outType":"value","parent":"n2","ports":{"col":{"arr":["tenant_id","post_id"]},"rows":{"ref":["n2"]}},"wirePassthrough":true},{"component":"executeSQL","id":"n4","outType":{"arr":"value"},"parent":"n3","ports":{"bigint":false,"params":{"arr":[{"ref":["n3"]}]},"returning":false,"sql":"SELECT tenant_id, comment_id, post_id, body FROM benchmark_tenant_comments WHERE EXISTS (SELECT 1 FROM json_each(?) je WHERE json_extract(je.value, '$[0]') = benchmark_tenant_comments.tenant_id AND json_extract(je.value, '$[1]') = benchmark_tenant_comments.post_id) ORDER BY comment_id ASC","write":false},"wirePassthrough":true},{"component":"group","id":"n5","outType":{"arr":"value"},"parent":"n2","ports":{"children":{"ref":["n4"]},"fk":{"arr":["tenant_id","post_id"]},"into":"comments","parents":{"ref":["n2"]},"pk":{"arr":["tenant_id","post_id"]},"single":false},"wirePassthrough":true},{"component":"group","id":"n6","outType":{"arr":{"obj":{}}},"parent":"n0","ports":{"children":{"ref":["n5"]},"fk":{"arr":["tenant_id","user_id"]},"into":"posts","parents":{"ref":["n0"]},"pk":{"arr":["tenant_id","user_id"]},"single":false}}],"inputPorts":{},"name":"compositeRelations","output":{"ref":["n6"]},"plan":{"concurrency":16,"groups":[[0],[1],[2],[3],[4],[5],[6]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{}}},"ports":{"bigint":false,"params":{"arr":[{"ref":["email"]},{"ref":["name"]}]},"returning":false,"sql":"INSERT INTO benchmark_users (email, name) VALUES (?, ?)","write":true}}],"inputPorts":{"email":{"required":true,"type":"value"},"name":{"required":true,"type":"value"}},"name":"create","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{}}},"ports":{"bigint":false,"params":{"arr":[{"ref":["name"]},{"ref":["id"]}]},"returning":false,"sql":"UPDATE benchmark_users SET name = ? WHERE id = ?","write":true}}],"inputPorts":{"id":{"required":true,"type":"value"},"name":{"required":true,"type":"value"}},"name":"update","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{}}},"ports":{"bigint":false,"params":{"arr":[{"ref":["email"]},{"ref":["name"]}]},"returning":true,"sql":"INSERT INTO benchmark_users (email, name) VALUES (?, ?) ON CONFLICT (email) DO UPDATE SET email = excluded.email, name = excluded.name RETURNING id","write":true}}],"inputPorts":{"email":{"required":true,"type":"value"},"name":{"required":true,"type":"value"}},"name":"upsert","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{}}},"ports":{"bigint":false,"params":{"arr":[{"ref":["rows"]}]},"returning":false,"sql":"INSERT INTO benchmark_users (email, name) SELECT json_extract(value, '$.email'), json_extract(value, '$.name') FROM json_each(?)","write":true}}],"inputPorts":{"rows":{"required":true,"type":"value"}},"name":"createMany","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{}}},"ports":{"bigint":false,"params":{"arr":[{"ref":["rows"]}]},"returning":false,"sql":"INSERT INTO benchmark_users (email, name) SELECT json_extract(value, '$.email'), json_extract(value, '$.name') FROM json_each(?) WHERE true ON CONFLICT (email) DO UPDATE SET email = excluded.email, name = excluded.name","write":true}}],"inputPorts":{"rows":{"required":true,"type":"value"}},"name":"upsertMany","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{}}},"ports":{"bigint":false,"params":{"arr":[{"ref":["rows"]},{"ref":["rows"]}]},"returning":false,"sql":"UPDATE benchmark_users SET name = (SELECT json_extract(je.value, '$.name') FROM json_each(?) je WHERE json_extract(je.value, '$.id') = benchmark_users.id LIMIT 1) WHERE id IN (SELECT json_extract(value, '$.id') FROM json_each(?))","write":true}}],"inputPorts":{"rows":{"required":true,"type":"value"}},"name":"updateMany","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{}}}}]}