{"irVersion":2,"exprVersion":2,"components":[{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{"id":"float","email":{"opt":"string"},"name":{"opt":"string"}}}},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[]},"returning":false,"sql":"SELECT id, email, name FROM benchmark_users ORDER BY id ASC LIMIT 100","write":false}}],"inputPorts":{},"name":"findAll","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{"id":"float","email":{"opt":"string"},"name":{"opt":"string"}}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{"id":"float","title":{"opt":"string"},"content":{"opt":"string"},"published":{"opt":"float"},"author_id":{"opt":"float"},"created_at":{"opt":"string"}}}},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"where":{"elemType":"string","required":false,"type":"array"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["published"]}]},"returning":false,"sql":"SELECT id, title, content, published, author_id, created_at FROM benchmark_posts WHERE published = ? ORDER BY created_at DESC LIMIT 20 OFFSET 10","write":false}}],"inputPorts":{"published":{"required":true,"type":"int"}},"name":"filterPaginateSort","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{"id":"float","title":{"opt":"string"},"content":{"opt":"string"},"published":{"opt":"float"},"author_id":{"opt":"float"},"created_at":{"opt":"string"}}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{"id":"float","email":{"opt":"string"},"name":{"opt":"string"}}}},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"where":{"elemType":"string","required":false,"type":"array"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["name"]}]},"returning":false,"sql":"SELECT id, email, name FROM benchmark_users WHERE name LIKE ? LIMIT 1","write":false}}],"inputPorts":{"name":{"required":true,"type":"string"}},"name":"findFirst","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{"id":"float","email":{"opt":"string"},"name":{"opt":"string"}}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{"id":"float","email":{"opt":"string"},"name":{"opt":"string"}}}},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"where":{"elemType":"string","required":false,"type":"array"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["email"]}]},"returning":false,"sql":"SELECT id, email, name FROM benchmark_users WHERE email = ? LIMIT 1","write":false}}],"inputPorts":{"email":{"required":true,"type":"string"}},"name":"findUnique","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{"id":"float","email":{"opt":"string"},"name":{"opt":"string"}}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":"value"},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[]},"returning":false,"sql":"SELECT id, email, name FROM benchmark_users LIMIT 100","write":false},"wirePassthrough":true},{"component":"pluck","id":"n1","outType":"value","parent":"n0","portSchemas":{"col":{"elemType":"string","required":true,"type":"array"},"rows":{"elemType":"value","required":true,"type":"array"}},"ports":{"col":{"arr":["id"]},"rows":{"ref":["n0"]}},"wirePassthrough":true},{"component":"executeSQL","id":"n2","outType":{"arr":"value"},"parent":"n1","portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["n1"]}]},"returning":false,"sql":"SELECT id, title, author_id FROM benchmark_posts WHERE author_id IN (SELECT JSON_UNQUOTE(v) FROM JSON_TABLE(?, '$[*]' COLUMNS(v JSON PATH '$')) jt) ORDER BY id ASC","write":false},"wirePassthrough":true},{"component":"group","id":"n3","outType":{"arr":{"obj":{}}},"parent":"n0","portSchemas":{"children":{"elemType":"value","required":true,"type":"array"},"fk":{"elemType":"string","required":true,"type":"array"},"into":{"required":true,"type":"string"},"parents":{"elemType":"value","required":true,"type":"array"},"pk":{"elemType":"string","required":true,"type":"array"},"single":{"required":true,"type":"bool"}},"ports":{"children":{"ref":["n2"]},"fk":{"arr":["author_id"]},"into":"posts","parents":{"ref":["n0"]},"pk":{"arr":["id"]},"single":false}}],"inputPorts":{},"name":"nestedFindAll","output":{"ref":["n3"]},"plan":{"concurrency":16,"groups":[[0],[1],[2],[3]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":"value"},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"where":{"elemType":"string","required":false,"type":"array"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["name"]}]},"returning":false,"sql":"SELECT id, email, name FROM benchmark_users WHERE name LIKE ? LIMIT 1","write":false},"wirePassthrough":true},{"component":"pluck","id":"n1","outType":"value","parent":"n0","portSchemas":{"col":{"elemType":"string","required":true,"type":"array"},"rows":{"elemType":"value","required":true,"type":"array"}},"ports":{"col":{"arr":["id"]},"rows":{"ref":["n0"]}},"wirePassthrough":true},{"component":"executeSQL","id":"n2","outType":{"arr":"value"},"parent":"n1","portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["n1"]}]},"returning":false,"sql":"SELECT id, title, author_id FROM benchmark_posts WHERE author_id IN (SELECT JSON_UNQUOTE(v) FROM JSON_TABLE(?, '$[*]' COLUMNS(v JSON PATH '$')) jt) ORDER BY id ASC","write":false},"wirePassthrough":true},{"component":"group","id":"n3","outType":{"arr":{"obj":{}}},"parent":"n0","portSchemas":{"children":{"elemType":"value","required":true,"type":"array"},"fk":{"elemType":"string","required":true,"type":"array"},"into":{"required":true,"type":"string"},"parents":{"elemType":"value","required":true,"type":"array"},"pk":{"elemType":"string","required":true,"type":"array"},"single":{"required":true,"type":"bool"}},"ports":{"children":{"ref":["n2"]},"fk":{"arr":["author_id"]},"into":"posts","parents":{"ref":["n0"]},"pk":{"arr":["id"]},"single":false}}],"inputPorts":{"name":{"required":true,"type":"string"}},"name":"nestedFindFirst","output":{"ref":["n3"]},"plan":{"concurrency":16,"groups":[[0],[1],[2],[3]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":"value"},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"where":{"elemType":"string","required":false,"type":"array"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["email"]}]},"returning":false,"sql":"SELECT id, email, name FROM benchmark_users WHERE email = ? LIMIT 1","write":false},"wirePassthrough":true},{"component":"pluck","id":"n1","outType":"value","parent":"n0","portSchemas":{"col":{"elemType":"string","required":true,"type":"array"},"rows":{"elemType":"value","required":true,"type":"array"}},"ports":{"col":{"arr":["id"]},"rows":{"ref":["n0"]}},"wirePassthrough":true},{"component":"executeSQL","id":"n2","outType":{"arr":"value"},"parent":"n1","portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["n1"]}]},"returning":false,"sql":"SELECT id, title, author_id FROM benchmark_posts WHERE author_id IN (SELECT JSON_UNQUOTE(v) FROM JSON_TABLE(?, '$[*]' COLUMNS(v JSON PATH '$')) jt) ORDER BY id ASC","write":false},"wirePassthrough":true},{"component":"group","id":"n3","outType":{"arr":{"obj":{}}},"parent":"n0","portSchemas":{"children":{"elemType":"value","required":true,"type":"array"},"fk":{"elemType":"string","required":true,"type":"array"},"into":{"required":true,"type":"string"},"parents":{"elemType":"value","required":true,"type":"array"},"pk":{"elemType":"string","required":true,"type":"array"},"single":{"required":true,"type":"bool"}},"ports":{"children":{"ref":["n2"]},"fk":{"arr":["author_id"]},"into":"posts","parents":{"ref":["n0"]},"pk":{"arr":["id"]},"single":false}}],"inputPorts":{"email":{"required":true,"type":"string"}},"name":"nestedFindUnique","output":{"ref":["n3"]},"plan":{"concurrency":16,"groups":[[0],[1],[2],[3]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":"value"},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[]},"returning":false,"sql":"SELECT id, email, name FROM benchmark_users LIMIT 100","write":false},"wirePassthrough":true},{"component":"pluck","id":"n1","outType":"value","parent":"n0","portSchemas":{"col":{"elemType":"string","required":true,"type":"array"},"rows":{"elemType":"value","required":true,"type":"array"}},"ports":{"col":{"arr":["id"]},"rows":{"ref":["n0"]}},"wirePassthrough":true},{"component":"executeSQL","id":"n2","outType":{"arr":"value"},"parent":"n1","portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["n1"]}]},"returning":false,"sql":"SELECT id, title, author_id FROM benchmark_posts WHERE author_id IN (SELECT JSON_UNQUOTE(v) FROM JSON_TABLE(?, '$[*]' COLUMNS(v JSON PATH '$')) jt) ORDER BY id ASC","write":false},"wirePassthrough":true},{"component":"pluck","id":"n3","outType":"value","parent":"n2","portSchemas":{"col":{"elemType":"string","required":true,"type":"array"},"rows":{"elemType":"value","required":true,"type":"array"}},"ports":{"col":{"arr":["id"]},"rows":{"ref":["n2"]}},"wirePassthrough":true},{"component":"executeSQL","id":"n4","outType":{"arr":"value"},"parent":"n3","portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["n3"]}]},"returning":false,"sql":"SELECT id, body, post_id FROM benchmark_comments WHERE post_id IN (SELECT JSON_UNQUOTE(v) FROM JSON_TABLE(?, '$[*]' COLUMNS(v JSON PATH '$')) jt) ORDER BY id ASC","write":false},"wirePassthrough":true},{"component":"group","id":"n5","outType":{"arr":"value"},"parent":"n2","portSchemas":{"children":{"elemType":"value","required":true,"type":"array"},"fk":{"elemType":"string","required":true,"type":"array"},"into":{"required":true,"type":"string"},"parents":{"elemType":"value","required":true,"type":"array"},"pk":{"elemType":"string","required":true,"type":"array"},"single":{"required":true,"type":"bool"}},"ports":{"children":{"ref":["n4"]},"fk":{"arr":["post_id"]},"into":"comments","parents":{"ref":["n2"]},"pk":{"arr":["id"]},"single":false},"wirePassthrough":true},{"component":"group","id":"n6","outType":{"arr":{"obj":{}}},"parent":"n0","portSchemas":{"children":{"elemType":"value","required":true,"type":"array"},"fk":{"elemType":"string","required":true,"type":"array"},"into":{"required":true,"type":"string"},"parents":{"elemType":"value","required":true,"type":"array"},"pk":{"elemType":"string","required":true,"type":"array"},"single":{"required":true,"type":"bool"}},"ports":{"children":{"ref":["n5"]},"fk":{"arr":["author_id"]},"into":"posts","parents":{"ref":["n0"]},"pk":{"arr":["id"]},"single":false}}],"inputPorts":{},"name":"nestedRelations","output":{"ref":["n6"]},"plan":{"concurrency":16,"groups":[[0],[1],[2],[3],[4],[5],[6]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":"value"},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[]},"returning":false,"sql":"SELECT tenant_id, user_id, name FROM benchmark_tenant_users ORDER BY user_id ASC LIMIT 100","write":false},"wirePassthrough":true},{"component":"pluck","id":"n1","outType":"value","parent":"n0","portSchemas":{"col":{"elemType":"string","required":true,"type":"array"},"rows":{"elemType":"value","required":true,"type":"array"}},"ports":{"col":{"arr":["tenant_id","user_id"]},"rows":{"ref":["n0"]}},"wirePassthrough":true},{"component":"executeSQL","id":"n2","outType":{"arr":"value"},"parent":"n1","portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["n1"]}]},"returning":false,"sql":"SELECT tenant_id, post_id, user_id, title FROM benchmark_tenant_posts WHERE (benchmark_tenant_posts.tenant_id, benchmark_tenant_posts.user_id) IN (SELECT JSON_UNQUOTE(c0), JSON_UNQUOTE(c1) FROM JSON_TABLE(?, '$[*]' COLUMNS(c0 JSON PATH '$[0]', c1 JSON PATH '$[1]')) jt) ORDER BY post_id ASC","write":false},"wirePassthrough":true},{"component":"pluck","id":"n3","outType":"value","parent":"n2","portSchemas":{"col":{"elemType":"string","required":true,"type":"array"},"rows":{"elemType":"value","required":true,"type":"array"}},"ports":{"col":{"arr":["tenant_id","post_id"]},"rows":{"ref":["n2"]}},"wirePassthrough":true},{"component":"executeSQL","id":"n4","outType":{"arr":"value"},"parent":"n3","portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["n3"]}]},"returning":false,"sql":"SELECT tenant_id, comment_id, post_id, body FROM benchmark_tenant_comments WHERE (benchmark_tenant_comments.tenant_id, benchmark_tenant_comments.post_id) IN (SELECT JSON_UNQUOTE(c0), JSON_UNQUOTE(c1) FROM JSON_TABLE(?, '$[*]' COLUMNS(c0 JSON PATH '$[0]', c1 JSON PATH '$[1]')) jt) ORDER BY comment_id ASC","write":false},"wirePassthrough":true},{"component":"group","id":"n5","outType":{"arr":"value"},"parent":"n2","portSchemas":{"children":{"elemType":"value","required":true,"type":"array"},"fk":{"elemType":"string","required":true,"type":"array"},"into":{"required":true,"type":"string"},"parents":{"elemType":"value","required":true,"type":"array"},"pk":{"elemType":"string","required":true,"type":"array"},"single":{"required":true,"type":"bool"}},"ports":{"children":{"ref":["n4"]},"fk":{"arr":["tenant_id","post_id"]},"into":"comments","parents":{"ref":["n2"]},"pk":{"arr":["tenant_id","post_id"]},"single":false},"wirePassthrough":true},{"component":"group","id":"n6","outType":{"arr":{"obj":{}}},"parent":"n0","portSchemas":{"children":{"elemType":"value","required":true,"type":"array"},"fk":{"elemType":"string","required":true,"type":"array"},"into":{"required":true,"type":"string"},"parents":{"elemType":"value","required":true,"type":"array"},"pk":{"elemType":"string","required":true,"type":"array"},"single":{"required":true,"type":"bool"}},"ports":{"children":{"ref":["n5"]},"fk":{"arr":["tenant_id","user_id"]},"into":"posts","parents":{"ref":["n0"]},"pk":{"arr":["tenant_id","user_id"]},"single":false}}],"inputPorts":{},"name":"compositeRelations","output":{"ref":["n6"]},"plan":{"concurrency":16,"groups":[[0],[1],[2],[3],[4],[5],[6]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{}}},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["email"]},{"ref":["name"]}]},"returning":false,"sql":"INSERT INTO benchmark_users (email, name) VALUES (?, ?)","write":true}}],"inputPorts":{"email":{"required":true,"type":"string"},"name":{"required":true,"type":"string"}},"name":"create","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{}}},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"where":{"elemType":"string","required":false,"type":"array"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["name"]},{"ref":["id"]}]},"returning":false,"sql":"UPDATE benchmark_users SET name = ? WHERE id = ?","write":true}}],"inputPorts":{"id":{"required":true,"type":"int"},"name":{"required":true,"type":"string"}},"name":"update","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{"id":"float"}}},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["email"]},{"ref":["name"]}]},"returning":true,"sql":"INSERT INTO benchmark_users (email, name) VALUES (?, ?) ON DUPLICATE KEY UPDATE email = VALUES(email), name = VALUES(name) RETURNING id","write":true}}],"inputPorts":{"email":{"required":true,"type":"string"},"name":{"required":true,"type":"string"}},"name":"upsert","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{"id":"float"}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{}}},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["rows"]}]},"returning":false,"sql":"INSERT INTO benchmark_users (email, name) SELECT JSON_UNQUOTE(jt.email), JSON_UNQUOTE(jt.name) FROM JSON_TABLE(?, '$[*]' COLUMNS(email JSON PATH '$.email', name JSON PATH '$.name')) jt","write":true}}],"inputPorts":{"rows":{"elemType":{"obj":{"email":"string","name":"string"}},"required":true,"type":"array"}},"name":"createMany","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{}}},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["rows"]}]},"returning":false,"sql":"INSERT INTO benchmark_users (email, name) SELECT JSON_UNQUOTE(jt.email), JSON_UNQUOTE(jt.name) FROM JSON_TABLE(?, '$[*]' COLUMNS(email JSON PATH '$.email', name JSON PATH '$.name')) jt ON DUPLICATE KEY UPDATE email = VALUES(email), name = VALUES(name)","write":true}}],"inputPorts":{"rows":{"elemType":{"obj":{"email":"string","name":"string"}},"required":true,"type":"array"}},"name":"upsertMany","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{}}},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["rows"]}]},"returning":false,"sql":"UPDATE benchmark_users AS u JOIN JSON_TABLE(?, '$[*]' COLUMNS(id JSON PATH '$.id', name JSON PATH '$.name')) AS v ON u.id = JSON_UNQUOTE(v.id) SET u.name = JSON_UNQUOTE(v.name)","write":true}}],"inputPorts":{"rows":{"elemType":{"obj":{"id":"int","name":"string"}},"required":true,"type":"array"}},"name":"updateMany","output":{"ref":["n0"]},"plan":{"concurrency":16,"groups":[[0]]},"outputType":{"arr":{"obj":{}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{"id":"float"}}},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["email"]},{"ref":["name"]}]},"returning":true,"sql":"INSERT INTO benchmark_users (email, name) VALUES (?, ?) RETURNING id","write":true}},{"id":"n1","map":{"as":"$e0","component":"executeSQL","over":{"ref":["n0"]},"parent":"n0","portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["$e0","id"]},{"ref":["title"]}]},"returning":false,"sql":"INSERT INTO benchmark_posts (author_id, title) VALUES (?, ?)","write":true}},"outType":{"arr":{"obj":{}}}}],"inputPorts":{"email":{"required":true,"type":"string"},"name":{"required":true,"type":"string"},"title":{"required":true,"type":"string"}},"name":"nestedCreate","output":{"ref":["n1"]},"plan":{"concurrency":16,"groups":[[0],[1]]},"outputType":{"arr":{"arr":{"obj":{}}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{"id":"float"}}},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["email"]},{"ref":["name"]}]},"returning":true,"sql":"INSERT INTO benchmark_users (email, name) VALUES (?, ?) ON DUPLICATE KEY UPDATE email = VALUES(email), name = VALUES(name) RETURNING id","write":true}},{"id":"n1","map":{"as":"$e0","component":"executeSQL","over":{"ref":["n0"]},"parent":"n0","portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["$e0","id"]},{"ref":["title"]}]},"returning":false,"sql":"INSERT INTO benchmark_posts (author_id, title) VALUES (?, ?)","write":true}},"outType":{"arr":{"obj":{}}}}],"inputPorts":{"email":{"required":true,"type":"string"},"name":{"required":true,"type":"string"},"title":{"required":true,"type":"string"}},"name":"nestedUpsert","output":{"ref":["n1"]},"plan":{"concurrency":16,"groups":[[0],[1]]},"outputType":{"arr":{"arr":{"obj":{}}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{"id":"float"}}},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"where":{"elemType":"string","required":false,"type":"array"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["name"]},{"ref":["id"]}]},"returning":true,"sql":"UPDATE benchmark_users SET name = ? WHERE id = ? RETURNING id","write":true}},{"id":"n1","map":{"as":"$e0","component":"executeSQL","over":{"ref":["n0"]},"parent":"n0","portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"where":{"elemType":"string","required":false,"type":"array"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["title"]},{"ref":["$e0","id"]}]},"returning":false,"sql":"UPDATE benchmark_posts SET title = ? WHERE author_id = ?","write":true}},"outType":{"arr":{"obj":{}}}}],"inputPorts":{"id":{"required":true,"type":"int"},"name":{"required":true,"type":"string"},"title":{"required":true,"type":"string"}},"name":"nestedUpdate","output":{"ref":["n1"]},"plan":{"concurrency":16,"groups":[[0],[1]]},"outputType":{"arr":{"arr":{"obj":{}}}}},{"body":[{"component":"executeSQL","id":"n0","outType":{"arr":{"obj":{"id":"float"}}},"portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"readColumns":{"elemType":{"obj":{}},"required":false,"type":"object"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["email"]},{"ref":["name"]}]},"returning":true,"sql":"INSERT INTO benchmark_users (email, name) VALUES (?, ?) RETURNING id","write":true}},{"id":"n1","map":{"as":"$e0","component":"executeSQL","over":{"ref":["n0"]},"parent":"n0","portSchemas":{"bigint":{"required":true,"type":"bool"},"params":{"elemType":"value","required":true,"type":"array"},"returning":{"required":true,"type":"bool"},"sql":{"required":true,"type":"string"},"where":{"elemType":"string","required":false,"type":"array"},"write":{"required":true,"type":"bool"}},"ports":{"bigint":false,"params":{"arr":[{"ref":["$e0","id"]}]},"returning":false,"sql":"DELETE FROM benchmark_users WHERE id = ?","write":true}},"outType":{"arr":{"obj":{}}}}],"inputPorts":{"email":{"required":true,"type":"string"},"name":{"required":true,"type":"string"}},"name":"delete","output":{"ref":["n1"]},"plan":{"concurrency":16,"groups":[[0],[1]]},"outputType":{"arr":{"arr":{"obj":{}}}}}]}